In [37]:
import pandas as pd

In [39]:
data = pd.read_csv("csv_files/AB_NYC_2019_1.csv")

In [41]:
data.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,19-10-2018,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,21-05-2019,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,05-07-2019,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,19-11-2018,0.10,1,0

In [43]:
data.shape

(48906, 16)

In [45]:
# now we will delete the rows having nan values along with the duplicate values
data.dropna(inplace = True)
data.drop_duplicates(inplace = True)

In [47]:
data.shape

(38821, 16)

In [49]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 38821 entries, 0 to 48852
Data columns (total 16 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              38821 non-null  int64
 1   name                            38821 non-null  object
 2   host_id                         38821 non-null  int64
 3   host_name                       38821 non-null  object
 4   neighbourhood_group             38821 non-null  object
 5   neighbourhood                   38821 non-null  object
 6   latitude                        38821 non-null  float64
 7   longitude                       38821 non-null  float64
 8   room_type                       38821 non-null  object
 9   price                           38821 non-null  int64
 10  minimum_nights                  38821 non-null  int64
 11  number_of_reviews               38821 non-null  int64
 12  last_review                     38821 non-null  object
 13  reviews_per_month               38821 non-null  float64
 14  calculated_host_listings_count  38821 non-null  int64
 15  availability_365                38821 non-null  int64
dtypes: float64(3), int64(7), object(6)
memory usage: 5.0+ MB

In [51]:
# now we datatype correction
data['id']=data['id'].astype('str')
data['host_id'] = data['host_id'].astype('str')
data['latitude']=data['latitude'].astype('str')
data['longitude']=data['longitude'].astype('str')
data['last_review']=pd.to_datetime(data['last_review'])

C:\Users\RETAM\AppData\Local\Temp\ipykernel_1728\3403650985.py:6: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  data['last_review']=pd.to_datetime(data['last_review'])

In [53]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 38821 entries, 0 to 48852
Data columns (total 16 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              38821 non-null  object
 1   name                            38821 non-null  object
 2   host_id                         38821 non-null  object
 3   host_name                       38821 non-null  object
 4   neighbourhood_group             38821 non-null  object
 5   neighbourhood                   38821 non-null  object
 6   latitude                        38821 non-null  object
 7   longitude                       38821 non-null  object
 8   room_type                       38821 non-null  object
 9   price                           38821 non-null  int64
 10  minimum_nights                  38821 non-null  int64
 11  number_of_reviews               38821 non-null  int64
 12  last_review                     38821 non-null  datetime64[ns]
 13  reviews_per_month               38821 non-null  float64
 14  calculated_host_listings_count  38821 non-null  int64
 15  availability_365                38821 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(5), object(9)
memory usage: 5.0+ MB

In [55]:
data.describe()

,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
count,38821.000000,38821.000000,38821.000000,38821,38821.000000,38821.000000,38821.000000
mean,142.332526,5.869220,29.290255,2018-10-04 07:23:47.072975872,1.373229,5.166611,114.886299
min,0.000000,1.000000,1.000000,2011-03-28 00:00:00,0.010000,1.000000,0.000000
25%,69.000000,1.000000,3.000000,2018-07-09 00:00:00,0.190000,1.000000,0.000000
50%,101.000000,2.000000,9.000000,2019-05-19 00:00:00,0.720000,1.000000,55.000000
75%,170.000000,4.000000,33.000000,2019-06-23 00:00:00,2.020000,2.000000,229.000000
max,10000.000000,1250.000000,629.000000,2019-07-08 00:00:00,58.500000,327.000000,365.000000
std,196.994756,17.389026,48.182900,NaN,1.680328,26.302954,129.529950

In [57]:
# doing non graphical data analysis
data.nunique()

id                                38821
name                              38244
host_id                           30232
host_name                          9885
neighbourhood_group                   5
neighbourhood                       218
latitude                          17436
longitude                         13639
room_type                             3
price                               581
minimum_nights                       89
number_of_reviews                   393
last_review                        1764
reviews_per_month                   937
calculated_host_listings_count       47
availability_365                    366
dtype: int64

In [61]:
data['neighbourhood_group'].value_counts()

neighbourhood_group
Manhattan        16621
Brooklyn         16439
Queens            4572
Bronx              875
Staten Island      314
Name: count, dtype: int64

In [67]:
data['neighbourhood_group'].value_counts(normalize=True)

neighbourhood_group
Manhattan        0.428145
Brooklyn         0.423456
Queens           0.117771
Bronx            0.022539
Staten Island    0.008088
Name: proportion, dtype: float64

In [69]:
data['room_type'].value_counts()

room_type
Entire home/apt    20321
Private room       17654
Shared room          846
Name: count, dtype: int64

In [71]:
data['room_type'].value_counts(normalize = True)

room_type
Entire home/apt    0.523454
Private room       0.454754
Shared room        0.021792
Name: proportion, dtype: float64

In [73]:
data['neighbourhood'].value_counts()

neighbourhood
Williamsburg          3163
Bedford-Stuyvesant    3141
Harlem                2204
Bushwick              1942
Hell's Kitchen        1528
                      ...
Holliswood               2
New Dorp Beach           2
Richmondtown             1
Rossville                1
Willowbrook              1
Name: count, Length: 218, dtype: int64

In [75]:
data['neighbourhood'].value_counts(normalize = True)

neighbourhood
Williamsburg          0.081477
Bedford-Stuyvesant    0.080910
Harlem                0.056773
Bushwick              0.050024
Hell's Kitchen        0.039360
                        ...
Holliswood            0.000052
New Dorp Beach        0.000052
Richmondtown          0.000026
Rossville             0.000026
Willowbrook           0.000026
Name: proportion, Length: 218, dtype: float64

In [81]:
df_n = data['neighbourhood'].value_counts().reset_index().rename(columns={"count":"No_of_hotels"})

In [83]:
df_n

          neighbourhood  No_of_hotels
0          Williamsburg          3163
1    Bedford-Stuyvesant          3141
2                Harlem          2204
3              Bushwick          1942
4        Hell's Kitchen          1528
..                  ...           ...
213          Holliswood             2
214      New Dorp Beach             2
215        Richmondtown             1
216           Rossville             1
217         Willowbrook             1

[218 rows x 2 columns]

In [85]:
# neighbourhoods in NYC which have the no of hotels greater than 1000

In [89]:
df_n[df_n['No_of_hotels']>500]

         neighbourhood  No_of_hotels
0         Williamsburg          3163
1   Bedford-Stuyvesant          3141
2               Harlem          2204
3             Bushwick          1942
4       Hell's Kitchen          1528
5         East Village          1489
6      Upper West Side          1482
7      Upper East Side          1405
8        Crown Heights          1265
9              Midtown           986
10         East Harlem           943
11          Greenpoint           866
12             Chelsea           827
13     Lower East Side           738
14  Washington Heights           721
15             Astoria           709
16        West Village           610
17  Financial District           509

In [93]:
# now we will do our analysis with the numerical columns

In [103]:
data['price'].value_counts(bins=5)
# this divides the price data into five parts

(-10.001, 2000.0]    38786
(2000.0, 4000.0]        20
(4000.0, 6000.0]         8
(8000.0, 10000.0]        5
(6000.0, 8000.0]         2
Name: count, dtype: int64